import PrankFriends


# TODO дописать тесты
lists = {1:
        """
        Серафимов А.А. P3110
        Кокорин И.Д. P3110
        Курочкин Д.Д. N2134
        Веселов К.К. P3110
        """,
         2: """
        Анисимов О.Д. P3424
        Антонова В.М. N2341
        Афанасьев А.И. N2341
        Блинова М.М. P3424
        Бочарова В.М. B2345
        Гаврилова В.В. B1242
        Давыдов П.С. S2345
            """,
         3: """
        Давыдова В.И. F3513
        Дмитриев М.К. F2351
        Журавлева Д.Д. F2351
        Золотарев Т.Б. F2351
        Кириллова П.Д. D2351
        Крючков А.И. P3251
        Леонтьев С.Д. P3511
        Лобанов М.А. P5112
        """,
         4: """
        Анисимов О.Д. P3424
        Антонова В.М. N2341
        Афанасьев А.И. N2341
        Блинова М.М. P3424
        Бочарова В.М. B2345
        Гаврилова В.В. B1242
        Давыдов П.С. S2345
            """,
         5: """
        Журавлева Д.Д. F2351
        Золотарев Т.Б. F2351
        Кириллова П.Д. D2351
        Крючков А.И. P3251
        Леонтьев С.Д. P3511
        Лобанов М.А. P5112
            """,
         }

# TODO дописать тесты
groups = {1: "P3110",
          2: "P3424",
          3: "F2351",
          4: "N2341",
          5: ""
          }

for i in range(1, len(lists)+1):
    print("group: ", groups[i])
    print("List was: ", lists[i])
    print("List now: ")
    PrankFriends.listprank(groups[i], lists[i])
    print("---------")


